app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "pins"
---
  def index
    @pins = Pin.order("created_at desc").page(params[:page]).per_page(10);

INSERT INTO "pins" ("created_at", "description", "guia", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 05 Feb 2014 04:30:56 UTC +00:00], ["description", "veracruz"], ["guia", "0002000S07660979000"], ["updated_at", Wed, 05 Feb 2014 04:30:56 UTC +00:00], ["user_id", 1]]
---
  def create
    @pin = current_user.pins.new(pin_params)

    respond_to do |format|
      if @pin.save

UPDATE "pins" SET "description" = ?, "medicame" = ?, "vale" = ?, "fecha" = ?, "updated_at" = ? WHERE "pins"."id" = 12  [["description", "09:30am"], ["medicame", "renagel"], ["vale", "395671"], ["fecha", "11/02/2014"], ["updated_at", Mon, 10 Feb 2014 03:31:59 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @pin.update(pin_params)